---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.ElectricalFrequency
source: html/e9296295-9ebe-416a-6686-ffef4b1f826c.htm
---
# Autodesk.Revit.DB.SpecTypeId.ElectricalFrequency Property

Frequency, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId ElectricalFrequency { get; }
```